1st_C_practice/index.org
#+LANGUAGE: ja
#+OPTIONS: \n:t author:nil creator:nil timestamp:nil html-postamble:nil toc:nil num:nil ^:{}
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../style1.css" />

#+TITLE: C言語 練習問題 

** 問１
以下の①～②にそれぞれ適切な語句を入れ、プログラムを完成させよ。

#+BEGIN_SRC c -n
#include <stdio.h>

/// 1989年～2018年までの、平成と西暦の対応表を出力する
int main()
{
	int year;

	// 平成元年は1989年
	for(  ①  )
	{
		printf("%d年 <=> 平成%d年\n", year, year - ②);
	}

	while(1);
}
#+END_SRC

** 問２
以下の①～⑧にそれぞれ適切な語句を入れ、プログラムを完成させよ。
(ヒント：①・④・⑥は演算子、②は整数)

#+BEGIN_SRC c -n
#include <time.h>
#include <stdlib.h>
#include <stdio.h>

/// 0～9の乱数を生成し、値に応じて大凶～大吉を決める
/**
 * 0は大凶、1～2は凶、3～5は小吉、6～8は中吉、9は大吉とする。
 */
int main()
{
   	// 現在時刻から乱数の種を生成
	srand((unsigned int)time(NULL));

	// 0～9の乱数を生成
	int omikuji = rand() ① ②;

  	// おみくじの結果文字列を格納する変数
	char* result;

	③(omikuji ④ 0)
	{
		result = "大凶";
	}
	⑤(omikuji ⑥ 2)
	{
		result = "凶";
	}
	⑤(omikuji ⑥ 5)
	{
		result = "小吉";
	}
	⑤(omikuji ⑥ 8)
	{
		result = "中吉";
	}
	⑦
	{
		result = "大吉";
	}

	// おみくじの結果を画面に表示する
	printf("⑧です", result);

	while(1);
}
#+END_SRC

** 問３
下記仕様を満たすC言語プログラムを作成せよ。

・10×10の2次元配列を生成し、２重ループを用いて下図のように値を設定する。
・値を設定した２次元配列の中身をprintf関数を用いて画面に表示する。(表示形式は問わない)
|---+---+----+----+----+----+----+----+----+----|
| 2 | 0 |  4 |  6 |  8 | 10 | 12 | 14 | 16 | 18 |
| 5 | 3 |  7 |  9 | 11 | 13 | 15 | 17 | 19 | 21 |
| 8 | 6 | 10 | 12 | 14 | 16 | 18 | 20 | 22 | 24 |
|---+---+----+----+----+----+----+----+----+----|
　　途中省略
|----+----+----+----+----+----+----+----+----+----|
| 21 | 23 | 25 | 27 | 29 | 31 | 33 | 35 | 37 | 39|
| 24 | 26 | 28 | 30 | 32 | 34 | 36 | 38 | 40 | 42 |
| 27 | 29 | 31 | 33 | 35 | 37 | 39 | 41 | 43 | 45 |
|----+----+----+----+----+----+----+----+----+----|

** 問４
下記仕様を満たすC言語プログラムを作成せよ。

- main関数内でint型の変数を2つ宣言し、適当な値で初期化する。
- 上記変数の値を入れ替える関数を作成し、main関数から呼び出す。
- 2つの変数の値をprintf関数で画面に表示し、値が入れ替わったことを確認する。

** 問５
下記仕様を満たすC言語プログラムを作成せよ。

- char型のメンバを2つ持つ構造体を定義する。
  定義時にtypedefを用い、以後使用する際に「struct」と記述しなくて済むようにすること。
- main関数内で上記構造体型の変数を宣言し、各メンバを適当な文字で初期化する。
- 上記メンバの値を入れ替える関数を作成し、main関数から呼び出す。
  ただし、当該関数の引数の個数は1つとする。
- 2つのメンバの値をprintf関数で画面に表示し、値が入れ替わったことを確認する。
