1st_C_practice/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>C言語 練習問題</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="../style1.css" />
</head>
<body>
<div id="content">
<h1 class="title">C言語 練習問題</h1>

<div id="outline-container-org7f227a8" class="outline-2">
<h2 id="org7f227a8">問１</h2>
<div class="outline-text-2" id="text-org7f227a8">
<p>
以下の①～②にそれぞれ適切な語句を入れ、プログラムを完成させよ。<br />
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="linenr"> 1: </span><span style="color: #7fffd4;">#include</span> <span style="color: #9e3655305530;">&lt;</span><span style="color: #61CE3C;">stdio.h</span><span style="color: #9e3655305530;">&gt;</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #2AA198; font-style: italic;">/// </span><span style="color: #2AA198; font-style: italic;">1989&#24180;&#65374;2018&#24180;&#12414;&#12391;&#12398;&#12289;&#24179;&#25104;&#12392;&#35199;&#26278;&#12398;&#23550;&#24540;&#34920;&#12434;&#20986;&#21147;&#12377;&#12427;</span>
<span class="linenr"> 4: </span><span style="color: #82A6DF;">int</span> <span style="color: #FF88FF;">main</span><span style="color: #9e3655305530;">()</span>
<span class="linenr"> 5: </span><span style="color: #9e3655305530;">{</span>
<span class="linenr"> 6: </span>    <span style="color: #82A6DF;">int</span> <span style="color: #FA583F;">year</span>;
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>    <span style="color: #2AA198; font-style: italic;">// </span><span style="color: #2AA198; font-style: italic;">&#24179;&#25104;&#20803;&#24180;&#12399;1989&#24180;</span>
<span class="linenr"> 9: </span>    <span style="color: #FFE329;">for</span><span style="color: #7abaa445df9e;">(</span>  &#9312;  <span style="color: #7abaa445df9e;">)</span>
<span class="linenr">10: </span>    <span style="color: #7abaa445df9e;">{</span>
<span class="linenr">11: </span>        printf<span style="color: #c6a1cb4a8a09;">(</span><span style="color: #61CE3C;">"%d&#24180; &lt;=&gt; &#24179;&#25104;%d&#24180;\n"</span>, year, year - &#9313;<span style="color: #c6a1cb4a8a09;">)</span>;
<span class="linenr">12: </span>    <span style="color: #7abaa445df9e;">}</span>
<span class="linenr">13: </span>
<span class="linenr">14: </span>    <span style="color: #FFE329;">while</span><span style="color: #7abaa445df9e;">(</span><span style="color: #FF951B;">1</span><span style="color: #7abaa445df9e;">)</span>;
<span class="linenr">15: </span><span style="color: #9e3655305530;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2d83a69" class="outline-2">
<h2 id="org2d83a69">問２</h2>
<div class="outline-text-2" id="text-org2d83a69">
<p>
以下の①～⑧にそれぞれ適切な語句を入れ、プログラムを完成させよ。<br />
(ヒント：①・④・⑥は演算子、②は整数)<br />
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="linenr"> 1: </span><span style="color: #7fffd4;">#include</span> <span style="color: #9e3655305530;">&lt;</span><span style="color: #61CE3C;">time.h</span><span style="color: #9e3655305530;">&gt;</span>
<span class="linenr"> 2: </span><span style="color: #7fffd4;">#include</span> <span style="color: #9e3655305530;">&lt;</span><span style="color: #61CE3C;">stdlib.h</span><span style="color: #9e3655305530;">&gt;</span>
<span class="linenr"> 3: </span><span style="color: #7fffd4;">#include</span> <span style="color: #9e3655305530;">&lt;</span><span style="color: #61CE3C;">stdio.h</span><span style="color: #9e3655305530;">&gt;</span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #2AA198; font-style: italic;">/// </span><span style="color: #2AA198; font-style: italic;">0&#65374;9&#12398;&#20081;&#25968;&#12434;&#29983;&#25104;&#12375;&#12289;&#20516;&#12395;&#24540;&#12376;&#12390;&#22823;&#20982;&#65374;&#22823;&#21513;&#12434;&#27770;&#12417;&#12427;</span>
<span class="linenr"> 6: </span><span style="color: #708090;">/**</span>
<span class="linenr"> 7: </span><span style="color: #708090;"> * 0&#12399;&#22823;&#20982;&#12289;1&#65374;2&#12399;&#20982;&#12289;3&#65374;5&#12399;&#23567;&#21513;&#12289;6&#65374;8&#12399;&#20013;&#21513;&#12289;9&#12399;&#22823;&#21513;&#12392;&#12377;&#12427;&#12290;</span>
<span class="linenr"> 8: </span><span style="color: #708090;"> */</span>
<span class="linenr"> 9: </span><span style="color: #82A6DF;">int</span> <span style="color: #FF88FF;">main</span><span style="color: #9e3655305530;">()</span>
<span class="linenr">10: </span><span style="color: #9e3655305530;">{</span>
<span class="linenr">11: </span>    <span style="color: #2AA198; font-style: italic;">// </span><span style="color: #2AA198; font-style: italic;">&#29694;&#22312;&#26178;&#21051;&#12363;&#12425;&#20081;&#25968;&#12398;&#31278;&#12434;&#29983;&#25104;</span>
<span class="linenr">12: </span>    srand<span style="color: #7abaa445df9e;">(</span><span style="color: #c6a1cb4a8a09;">(</span><span style="color: #82A6DF;">unsigned</span> <span style="color: #82A6DF;">int</span><span style="color: #c6a1cb4a8a09;">)</span>time<span style="color: #c6a1cb4a8a09;">(</span><span style="color: #FF951B;">NULL</span><span style="color: #c6a1cb4a8a09;">)</span><span style="color: #7abaa445df9e;">)</span>;
<span class="linenr">13: </span>
<span class="linenr">14: </span>    <span style="color: #2AA198; font-style: italic;">// </span><span style="color: #2AA198; font-style: italic;">0&#65374;9&#12398;&#20081;&#25968;&#12434;&#29983;&#25104;</span>
<span class="linenr">15: </span>    <span style="color: #82A6DF;">int</span> <span style="color: #FA583F;">omikuji</span> = rand<span style="color: #7abaa445df9e;">()</span> &#9312; &#9313;;
<span class="linenr">16: </span>
<span class="linenr">17: </span>    <span style="color: #2AA198; font-style: italic;">// </span><span style="color: #2AA198; font-style: italic;">&#12362;&#12415;&#12367;&#12376;&#12398;&#32080;&#26524;&#25991;&#23383;&#21015;&#12434;&#26684;&#32013;&#12377;&#12427;&#22793;&#25968;</span>
<span class="linenr">18: </span>    <span style="color: #82A6DF;">char</span>* <span style="color: #FA583F;">result</span>;
<span class="linenr">19: </span>
<span class="linenr">20: </span>    &#9314;<span style="color: #7abaa445df9e;">(</span>omikuji &#9315; <span style="color: #FF951B;">0</span><span style="color: #7abaa445df9e;">)</span>
<span class="linenr">21: </span>    <span style="color: #7abaa445df9e;">{</span>
<span class="linenr">22: </span>        result = <span style="color: #61CE3C;">"&#22823;&#20982;"</span>;
<span class="linenr">23: </span>    <span style="color: #7abaa445df9e;">}</span>
<span class="linenr">24: </span>    &#9316;<span style="color: #7abaa445df9e;">(</span>omikuji &#9317; <span style="color: #FF951B;">2</span><span style="color: #7abaa445df9e;">)</span>
<span class="linenr">25: </span>    <span style="color: #7abaa445df9e;">{</span>
<span class="linenr">26: </span>        result = <span style="color: #61CE3C;">"&#20982;"</span>;
<span class="linenr">27: </span>    <span style="color: #7abaa445df9e;">}</span>
<span class="linenr">28: </span>    &#9316;<span style="color: #7abaa445df9e;">(</span>omikuji &#9317; <span style="color: #FF951B;">5</span><span style="color: #7abaa445df9e;">)</span>
<span class="linenr">29: </span>    <span style="color: #7abaa445df9e;">{</span>
<span class="linenr">30: </span>        result = <span style="color: #61CE3C;">"&#23567;&#21513;"</span>;
<span class="linenr">31: </span>    <span style="color: #7abaa445df9e;">}</span>
<span class="linenr">32: </span>    &#9316;<span style="color: #7abaa445df9e;">(</span>omikuji &#9317; <span style="color: #FF951B;">8</span><span style="color: #7abaa445df9e;">)</span>
<span class="linenr">33: </span>    <span style="color: #7abaa445df9e;">{</span>
<span class="linenr">34: </span>        result = <span style="color: #61CE3C;">"&#20013;&#21513;"</span>;
<span class="linenr">35: </span>    <span style="color: #7abaa445df9e;">}</span>
<span class="linenr">36: </span>    &#9318;
<span class="linenr">37: </span>    <span style="color: #7abaa445df9e;">{</span>
<span class="linenr">38: </span>        result = <span style="color: #61CE3C;">"&#22823;&#21513;"</span>;
<span class="linenr">39: </span>    <span style="color: #7abaa445df9e;">}</span>
<span class="linenr">40: </span>
<span class="linenr">41: </span>    <span style="color: #2AA198; font-style: italic;">// </span><span style="color: #2AA198; font-style: italic;">&#12362;&#12415;&#12367;&#12376;&#12398;&#32080;&#26524;&#12434;&#30011;&#38754;&#12395;&#34920;&#31034;&#12377;&#12427;</span>
<span class="linenr">42: </span>    printf<span style="color: #7abaa445df9e;">(</span><span style="color: #61CE3C;">"&#9319;&#12391;&#12377;"</span>, result<span style="color: #7abaa445df9e;">)</span>;
<span class="linenr">43: </span>
<span class="linenr">44: </span>    <span style="color: #FFE329;">while</span><span style="color: #7abaa445df9e;">(</span><span style="color: #FF951B;">1</span><span style="color: #7abaa445df9e;">)</span>;
<span class="linenr">45: </span><span style="color: #9e3655305530;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org83676be" class="outline-2">
<h2 id="org83676be">問３</h2>
<div class="outline-text-2" id="text-org83676be">
<p>
下記仕様を満たすC言語プログラムを作成せよ。<br />
</p>

<p>
・10×10の2次元配列を生成し、２重ループを用いて下図のように値を設定する。<br />
・値を設定した２次元配列の中身をprintf関数を用いて画面に表示する。(表示形式は問わない)<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">2</td>
<td class="org-right">0</td>
<td class="org-right">4</td>
<td class="org-right">6</td>
<td class="org-right">8</td>
<td class="org-right">10</td>
<td class="org-right">12</td>
<td class="org-right">14</td>
<td class="org-right">16</td>
<td class="org-right">18</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-right">3</td>
<td class="org-right">7</td>
<td class="org-right">9</td>
<td class="org-right">11</td>
<td class="org-right">13</td>
<td class="org-right">15</td>
<td class="org-right">17</td>
<td class="org-right">19</td>
<td class="org-right">21</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-right">6</td>
<td class="org-right">10</td>
<td class="org-right">12</td>
<td class="org-right">14</td>
<td class="org-right">16</td>
<td class="org-right">18</td>
<td class="org-right">20</td>
<td class="org-right">22</td>
<td class="org-right">24</td>
</tr>
</tbody>
</table>
<p>
　　途中省略<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">21</td>
<td class="org-right">23</td>
<td class="org-right">25</td>
<td class="org-right">27</td>
<td class="org-right">29</td>
<td class="org-right">31</td>
<td class="org-right">33</td>
<td class="org-right">35</td>
<td class="org-right">37</td>
<td class="org-right">39</td>
</tr>

<tr>
<td class="org-right">24</td>
<td class="org-right">26</td>
<td class="org-right">28</td>
<td class="org-right">30</td>
<td class="org-right">32</td>
<td class="org-right">34</td>
<td class="org-right">36</td>
<td class="org-right">38</td>
<td class="org-right">40</td>
<td class="org-right">42</td>
</tr>

<tr>
<td class="org-right">27</td>
<td class="org-right">29</td>
<td class="org-right">31</td>
<td class="org-right">33</td>
<td class="org-right">35</td>
<td class="org-right">37</td>
<td class="org-right">39</td>
<td class="org-right">41</td>
<td class="org-right">43</td>
<td class="org-right">45</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgfa595af" class="outline-2">
<h2 id="orgfa595af">問４</h2>
<div class="outline-text-2" id="text-orgfa595af">
<p>
下記仕様を満たすC言語プログラムを作成せよ。<br />
</p>

<ul class="org-ul">
<li>main関数内でint型の変数を2つ宣言し、適当な値で初期化する。<br /></li>
<li>上記変数の値を入れ替える関数を作成し、main関数から呼び出す。<br /></li>
<li>2つの変数の値をprintf関数で画面に表示し、値が入れ替わったことを確認する。<br /></li>
</ul>
</div>
</div>

<div id="outline-container-orgfa5a9fe" class="outline-2">
<h2 id="orgfa5a9fe">問５</h2>
<div class="outline-text-2" id="text-orgfa5a9fe">
<p>
下記仕様を満たすC言語プログラムを作成せよ。<br />
</p>

<ul class="org-ul">
<li>char型のメンバを2つ持つ構造体を定義する。<br />
定義時にtypedefを用い、以後使用する際に「struct」と記述しなくて済むようにすること。<br /></li>
<li>main関数内で上記構造体型の変数を宣言し、各メンバを適当な文字で初期化する。<br /></li>
<li>上記メンバの値を入れ替える関数を作成し、main関数から呼び出す。<br />
ただし、当該関数の引数の個数は1つとする。<br /></li>
<li>2つのメンバの値をprintf関数で画面に表示し、値が入れ替わったことを確認する。<br /></li>
</ul>
</div>
</div>
</div>
</body>
</html>
